## KPMG Data Quality Assessment Task

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

cust_addr = pd.read_csv(r"C:\Users\ACER\Desktop\Data Camp\KPMG Internship\CustomerAddress.csv")
cust_addr = cust_addr[["customer_id","address","postcode","state","country","property_valuation"]]

new_cust_list = pd.read_csv(r"C:\Users\ACER\Desktop\Data Camp\KPMG Internship\NewCustomerList.csv")

trans = pd.read_csv(r"C:\Users\ACER\Desktop\Data Camp\KPMG Internship\Transactions.csv")

cust_demo = pd.read_csv(r"C:\Users\ACER\Desktop\Data Camp\KPMG Internship\CustomerDemographic.csv")
#cust_demo = cust_demo[['customer_id','first_name','last_name','gender','past_3_years_bike_related_purchases','DOB','job_title','job_industry_category','wealth_segment','deceased_indicator','owns_car','tenure']]

#### Exploring Customer Address

In [2]:
cust_addr.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [3]:
len(cust_addr)

3999

In [4]:
cust_addr['customer_id'].nunique()
#number of unique ids is okay

3999

In [5]:
cust_addr.value_counts('address')

address
3 Talisman Place           2
64 Macpherson Junction     2
3 Mariners Cove Terrace    2
0 3rd Road                 1
654 Logan Plaza            1
                          ..
31435 Eagle Crest Drive    1
31435 Surrey Court         1
3144 Ruskin Trail          1
31445 Morningstar Drive    1
9993 Mccormick Street      1
Length: 3996, dtype: int64

In [6]:
cust_addr[cust_addr['address'].isin(['3 Talisman Place','64 Macpherson Junction','3 Mariners Cove Terrace'])]
#it's possible 2 customers stay at the same address, BUT Macpherson Junction looks invalid

,customer_id,address,postcode,state,country,property_valuation
732,737,3 Talisman Place,4811,QLD,Australia,2
2315,2320,64 Macpherson Junction,2208,NSW,Australia,11
2328,2333,3 Mariners Cove Terrace,3108,VIC,Australia,10
2470,2475,3 Talisman Place,4017,QLD,Australia,5
2980,2985,3 Mariners Cove Terrace,2216,NSW,Australia,10
3535,3540,64 Macpherson Junction,4061,QLD,Australia,8

In [7]:
cust_addr.isna().sum()

customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In [8]:
cust_addr.value_counts('country')
#all records are in Australia so the column is useless

country
Australia    3999
dtype: int64

In [9]:
cust_addr.value_counts('state')
#NSW and New South Wales
#VIC and Victoria

state
NSW                2054
VIC                 939
QLD                 838
New South Wales      86
Victoria             82
dtype: int64

In [10]:
cust_addr['state'] = cust_addr['state'].str.replace("New South Wales","NSW")
cust_addr['state'] = cust_addr['state'].str.replace("Victoria","VIC")
cust_addr.value_counts('state')

state
NSW    2140
VIC    1021
QLD     838
dtype: int64

#### Exploring Customer Demographic

In [6]:
cust_demo.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
0,1,Laraine,Medendorp,F,93,12/10/1953,Executive Secretary,Health,Mass Customer,N,Yes,11.0
1,2,Eli,Bockman,Male,81,16/12/1980,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0
2,3,Arlin,Dearle,Male,61,20/01/1954,Recruiting Manager,Property,Mass Customer,N,Yes,15.0
3,4,Talbot,NaN,Male,33,03/10/1961,NaN,IT,Mass Customer,N,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,13/05/1977,Senior Editor,NaN,Affluent Customer,N,Yes,8.0

In [7]:
len(cust_demo)

4000

In [11]:
cust_demo['customer_id'].nunique()

4000

In [21]:
cust_demo.isna().sum()
# null last_name rows may not affect analysis
# may need to exclude rows with null DOB
# number of rows with empty job_title, job_industry_category is more than 10% of total, analysing with job titles may prove troublesome
# null tenure rows can be excluded

customer_id                              0
first_name                               0
last_name                              121
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                      0
job_title                              497
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
dtype: int64

In [33]:
cust_demo.dtypes
#the DOB data type is incorrect

customer_id                              int64
first_name                              object
last_name                               object
gender                                  object
past_3_years_bike_related_purchases      int64
DOB                                     object
job_title                               object
job_industry_category                   object
wealth_segment                          object
deceased_indicator                      object
owns_car                                object
tenure                                 float64
dtype: object

In [37]:
cust_demo['DOB'] = pd.to_datetime(cust_demo['DOB'])
cust_demo[['DOB']].dtypes
#DOB has been converted to proper date-time format

DOB    datetime64[ns]
dtype: object

In [14]:
cust_demo = cust_demo.dropna(subset=['DOB','tenure'])
cust_demo.isna().sum()

customer_id                              0
first_name                               0
last_name                              121
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                      0
job_title                              497
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
dtype: int64

In [15]:
cust_demo['gender'].value_counts()
#incorrect text for gender

Female    2037
Male      1872
F            1
U            1
Femal        1
M            1
Name: gender, dtype: int64

In [17]:
cust_demo['gender'].mask((cust_demo['gender'] == 'F')|(cust_demo['gender'] == 'Femal'),'Female',inplace = True)
cust_demo['gender'].mask(cust_demo['gender'] == 'M','Male',inplace=True)
cust_demo['gender'].mask(cust_demo['gender'] == 'U','Undefined',inplace=True)
cust_demo['gender'].value_counts()
#gender column is OKAY

Female       2039
Male         1873
Undefined       1
Name: gender, dtype: int64

In [19]:
cust_demo['deceased_indicator'].value_counts()
#deceased is OKAY, but Y's can be removed

N    3911
Y       2
Name: deceased_indicator, dtype: int64

In [20]:
cust_demo['owns_car'].value_counts()
#owns_car values are okay

Yes    1974
No     1939
Name: owns_car, dtype: int64

In [28]:
cust_demo['wealth_segment'].value_counts()

Mass Customer        1954
High Net Worth        996
Affluent Customer     963
Name: wealth_segment, dtype: int64

In [32]:
cust_demo['DOB'].sort_values(ascending = True)

470     01/01/1956
3636    01/01/1958
461     01/01/1960
540     01/01/1966
3848    01/01/1968
           ...
3510    31/12/1966
1236    31/12/1969
2578    31/12/1970
2901    31/12/1974
799     31/12/1978
Name: DOB, Length: 3913, dtype: object

#### Exploring New Customer List

In [22]:
new_cust_list.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,rank,value
0,Chickie,Brister,Male,86,12/07/1957,General Manager,Manufacturing,Mass Customer,N,Yes,14,45 Shopko Center,4500,QLD,Australia,6,1,1.718750
1,Morly,Genery,Male,69,22/03/1970,Structural Engineer,Property,Mass Customer,N,No,16,14 Mccormick Park,2113,NSW,Australia,11,1,1.718750
2,Ardelis,Forrester,Female,10,28/08/1974,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,10,5 Colorado Crossing,3505,VIC,Australia,5,1,1.718750
3,Lucine,Stutt,Female,64,28/01/1979,Account Representative III,Manufacturing,Affluent Customer,N,Yes,5,207 Annamark Plaza,4814,QLD,Australia,1,4,1.703125
4,Melinda,Hadlee,Female,34,21/09/1965,Financial Analyst,Financial Services,Affluent Customer,N,No,19,115 Montana Place,2093,NSW,Australia,9,4,1.703125

In [23]:
new_cust_list.isna().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
rank                                     0
value                                    0
dtype: int64

In [24]:
len(new_cust_list)

1000

In [27]:
new_cust_list = new_cust_list.dropna(subset=['last_name','DOB'])
new_cust_list.isna().sum()

first_name                               0
last_name                                0
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                      0
job_title                              102
job_industry_category                  159
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
rank                                     0
value                                    0
dtype: int64

In [29]:
new_cust_list['gender'].value_counts()
#gender column is OKAY

Female    499
Male      455
Name: gender, dtype: int64

In [3]:
new_cust_list['job_title'].value_counts()

Associate Professor         15
Environmental Tech          14
Software Consultant         14
Chief Design Engineer       13
Assistant Manager           12
                            ..
Accountant II                1
Programmer IV                1
Administrative Officer       1
Accounting Assistant III     1
Web Developer I              1
Name: job_title, Length: 184, dtype: int64

In [39]:
new_cust_list['DOB'] = pd.to_datetime(new_cust_list['DOB'])
#Like the customer demo dataframe, we convert the DOB column to Date time
new_cust_list[['DOB']].head()

         DOB
0 1957-12-07
1 1970-03-22
2 1974-08-28
3 1979-01-28
4 1965-09-21

In [41]:
new_cust_list[['DOB']].sort_values(by=['DOB'],ascending=False)

            DOB
596  31/12/1978
97   31/10/1994
361  31/10/1979
632  31/10/1975
57   31/10/1972
..          ...
775         NaN
835         NaN
883         NaN
904         NaN
984         NaN

[1000 rows x 1 columns]

In [30]:
new_cust_list['job_industry_category'].value_counts()

Manufacturing         195
Financial Services    194
Health                149
Retail                 78
Property               62
IT                     35
Entertainment          34
Argiculture            25
Telecommunications     23
Name: job_industry_category, dtype: int64

#### Exploring Transactions

In [40]:
trans.head()

,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,False,Approved,Solex,Standard,medium,medium,71.49,$53.62,41245.0
1,True,Approved,Trek Bicycles,Standard,medium,large,2091.47,$388.92,41701.0
2,False,Approved,OHM Cycles,Standard,low,medium,1793.43,$248.82,36361.0
3,False,Approved,Norco Bicycles,Standard,medium,medium,1198.46,$381.10,36145.0
4,True,Approved,Giant Bicycles,Standard,medium,large,1765.30,$709.48,42226.0

In [42]:
len(trans)

20000

In [41]:
trans.isna().sum()

online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [46]:
trans[trans['online_order'].isnull()]

,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
97,NaN,Approved,Trek Bicycles,Road,medium,medium,533.51,$400.13,37823.0
166,NaN,Approved,Norco Bicycles,Standard,low,medium,363.01,$290.41,38482.0
169,NaN,Approved,OHM Cycles,Standard,high,medium,227.88,$136.73,37838.0
250,NaN,Approved,Solex,Standard,medium,medium,1483.20,$99.59,42145.0
300,NaN,Approved,Giant Bicycles,Standard,medium,large,1765.30,$709.48,35455.0
...,...,...,...,...,...,...,...,...,...
19514,NaN,Approved,OHM Cycles,Standard,high,medium,2005.66,"$1,203.40",37823.0
19573,NaN,Approved,Solex,Standard,medium,medium,575.27,$431.45,41345.0
19580,NaN,Approved,Trek Bicycles,Road,medium,medium,533.51,$400.13,41064.0
19635,NaN,Approved,Trek Bicycles,Standard,high,medium,358.39,$215.03,38002.0
19843,NaN,Approved,Trek Bicycles,Standard,medium,large,2091.47,$388.92,37823.0

In [47]:
trans[trans['brand'].isnull()]
#the same 197 rows have null values in brand, product_line, product_class etc.

,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
136,False,Approved,NaN,NaN,NaN,NaN,1942.61,NaN,NaN
159,False,Approved,NaN,NaN,NaN,NaN,1656.86,NaN,NaN
366,False,Approved,NaN,NaN,NaN,NaN,850.89,NaN,NaN
406,True,Approved,NaN,NaN,NaN,NaN,710.59,NaN,NaN
676,False,Approved,NaN,NaN,NaN,NaN,1972.01,NaN,NaN
...,...,...,...,...,...,...,...,...,...
19340,True,Approved,NaN,NaN,NaN,NaN,744.54,NaN,NaN
19383,False,Approved,NaN,NaN,NaN,NaN,1098.18,NaN,NaN
19793,False,Approved,NaN,NaN,NaN,NaN,868.56,NaN,NaN
19859,True,Approved,NaN,NaN,NaN,NaN,1497.43,NaN,NaN
19871,True,Approved,NaN,NaN,NaN,NaN,867.92,NaN,NaN

In [48]:
trans = trans.dropna(subset=['brand'])
trans.isna().sum()

online_order               358
order_status                 0
brand                        0
product_line                 0
product_class                0
product_size                 0
list_price                   0
standard_cost                0
product_first_sold_date      0
dtype: int64

In [16]:
trans['order_status'].value_counts()

Approved     19821
Cancelled      179
Name: order_status, dtype: int64

In [18]:
trans['brand'].value_counts()

Solex             4253
Giant Bicycles    3312
WeareA2B          3295
OHM Cycles        3043
Trek Bicycles     2990
Norco Bicycles    2910
Name: brand, dtype: int64

In [19]:
trans['product_line'].value_counts()

Standard    14176
Road         3970
Touring      1234
Mountain      423
Name: product_line, dtype: int64

In [20]:
trans['product_class'].value_counts()

medium    13826
high       3013
low        2964
Name: product_class, dtype: int64

In [21]:
trans['product_size'].value_counts()

medium    12990
large      3976
small      2837
Name: product_size, dtype: int64

In [36]:
# standard cost dollar sign needs to be removed and converted
#trans['standard_cost'] = trans['standard_cost'].str.replace('$','', regex=True)
#trans['standard_cost'] = trans['standard_cost'].str.replace(',','').astype(float)
trans['standard_cost']

0          53.62
1         388.92
2         248.82
3         381.10
4         709.48
          ...
19995    1203.40
19996     312.74
19997      44.71
19998     136.73
19999    1580.47
Name: standard_cost, Length: 20000, dtype: float64

In [38]:
trans['product_first_sold_date']

0        41245.0
1        41701.0
2        36361.0
3        36145.0
4        42226.0
          ...
19995    37823.0
19996    35560.0
19997    40410.0
19998    38216.0
19999    36334.0
Name: product_first_sold_date, Length: 20000, dtype: float64